var hottakeButton = document.querySelector("#hottake-button");
var subjectText = document.querySelector("#subject-text");
var theseText = document.querySelector("#these-text");
var currentSubject = "FKW ist der beste Podcast";

window.onload = function() {
    numberRandom = generaRandom(phSubject.length);
    subjectText.innerHTML = phSubject[numberRandom];
    numberRandom = generaRandom(phThese.length);
    theseText.innerHTML = phThese[numberRandom];
};

hottakeButton.addEventListener('click', game);

function game() {
    const attempts = numberAttempts(3, 12);
    let t1 = 0,
        t2 = 0;

    let slot1 = setInterval(function() {
        numberRandom = generaRandom(phSubject.length);
        subjectText.innerHTML = phSubject[numberRandom];
        console.log(phSubject[numberRandom]);
        t1++;
        if (t1 == attempts) {
            clearInterval(slot1);
            return null;
        }
    }, 100);

    let slot2 = setInterval(function() {
        t2++;
        if (t2 == attempts) {
            clearInterval(slot2);
            return null;
        }
        numberRandom = generaRandom(phThese.length);
        theseText.innerHTML = phThese[numberRandom];
        console.log(phThese[numberRandom]);
    }, 100);
}

function generaRandom(max) {
    return Math.floor((Math.random() * max));
}

function numberAttempts(min, max) {
    return Math.floor((Math.random() * (max - min + 1)) + min);
}

var phSubject = [
   
'Tadej Pogačar',
'Wout van Aert',
'Pello Bilbao',
'Arnaud De Lie',
'Jasper Philipsen',
'Mads Pedersen',
'Arnaud Démare',
'Christophe Laporte',
'Mathieu van der Poel',
'Neilson Powless',
'Biniam Girmay',
'Thomas Pidcock',
'Matej Mohorič',
'Benoît Cosnefroy',
'Diego Ulissi',
'Sam Bennett',
'Caleb Ewan',
'Luca Mozzato',
'Quinten Hermans',
'Filippo Ganna',
'Damiano Caruso',
'Matteo Trentin',
'Benjamin Thomas',
'Magnus Cort',
'Warren Barguil',
'Bryan Coquard',
'Iván García Cortina',
'Alberto Bettiol',
'Matis Louvel',
'Mark Cavendish',
'Julian Alaphilippe',
'Greg van Avermaet',
'Peter Sagan',
'Jasper Stuyven',
'Andrea Piccolo',
'Corbin Strong',
'Andrea Vendrame',
'Giacomo Nizzolo',
'Andrea Pasqualon',
'Yves Lampaert',
'Davide Formolo',
'Jan Tratnik',
'Attila Valter',
'Florian Sénéchal',
'Samuele Battistella',
'Mike Teunissen',
'Søren Kragh andersen',
'Oliver Naesen',
'Felix Grossschartne',
'Michał Kwiatkowski',
'Mikkel Frølich Honoré',
'Kevin Geniets',
'Alessandro Covi',
'Marius Mayrhofer',
'Jonathan Milan',
'Elia Viviani',
'Nathan van Hooydonck',
'Edoardo Affini',
'Domen Novak',
'John Degenkolb',
'Pascal Eenkhoorn',
'Zdeněk Štybar',
'Kevin Vermaerke',
'Pavel Bittner',
'Elmar Reinders',
'Matthew Dinham',
'Maciej Bodnar',
'Alexis Renard',
'Michael Schär',
'Riccardo Lucca',
'Alex Kirsch',
'Samuele Zoccarato',
'Frederik Frison',
'Nils Eekhoff',
'Daniel Oss',
'Jacopo Guarnieri',
'Lawrence Naesen',
'Simon Pellaud',
'Larry Warbasse',
'Florian Stork'

];

var phThese = [
    "attacks on the Poggio",
    "pushes 6w/kg (the song) for preparation",
    "pushes 6w/kg (both the song and the power)",
    "early breakaway with three team mates",
    "attacks on the descent",
    "wins the bunch sprint",
    "wins the sprint from a reduced group",
    "cracks on the Poggio",
    "DSQed (sock length)",
    "DNF (f*cking SRAM)",
    "monument victory",
    "destroys everyone",
    "first on the Poggio, 5th on the finish line",
    "DSQed (drafting)",
    "did a reckon of the whole route",
    "60km solo",
    "chases the break for 5 hours straight",
    "uses a dropper post",
    "attack on the Cipressa, caught before the Poggio"

];

var emojis = [
    '😄', '😃', '😀', '😊', '☺', '😉', '😍', '😘', '😚', '😗', '😙', '😜', '😝', '😛', '😳', '😁', '😔', '😌', '😒', '😞', '😣', '😢', '😂', '😭', '😪', '😥', '😰', '😅', '😓', '😩', '😫', '😨', '😱', '😠', '😡', '😤', '😖', '😆', '😋', '😷', '😎', '😴', '😵', '😲', '😟', '😦', '😧', '😈', '👿', '😮', '😬', '😐', '😕', '😯', '😶', '😇', '😏', '😑', '👲', '👳', '👮', '👷', '💂', '👶', '👦', '👧', '👨', '👩', '👴', '👵', '👱', '👼', '👸', '😺', '😸', '😻', '😽', '😼', '🙀', '😿', '😹', '😾', '👹', '👺', '🙈', '🙉', '🙊', '💀', '👽', '💩', '🔥', '✨', '🌟', '💫', '💥', '💢', '💦', '💧', '💤', '💨', '👂', '👀', '👃', '👅', '👄', '👍', '👎', '👌', '👊', '✊', '✌', '👋', '✋', '👐', '👆', '👇', '👉', '👈', '🙌', '🙏', '☝', '👏', '💪', '🚶', '🏃', '💃', '👫', '👪', '👬', '👭', '💏', '💑', '👯', '🙆', '🙅', '💁', '🙋', '💆', '💇', '💅', '👰', '🙎', '🙍', '🙇', '🎩', '👑', '👒', '👟', '👞', '👡', '👠', '👢', '👕', '👔', '👚', '👗', '🎽', '👖', '👘', '👙', '💼', '👜', '👝', '👛', '👓', '🎀', '🌂', '💄', '💛', '💙', '💜', '💚', '❤', '💔', '💗', '💓', '💕', '💖', '💞', '💘', '💌', '💋', '💍', '💎', '👤', '👥', '💬', '👣', '💭', '🐶', '🐺', '🐱', '🐭', '🐹', '🐰', '🐸', '🐯', '🐨', '🐻', '🐷', '🐽', '🐮', '🐗', '🐵', '🐒', '🐴', '🐑', '🐘', '🐼', '🐧', '🐦', '🐤', '🐥', '🐣', '🐔', '🐍', '🐢', '🐛', '🐝', '🐜', '🐞', '🐌', '🐙', '🐚', '🐠', '🐟', '🐬', '🐳', '🐋', '🐄', '🐏', '🐀', '🐃', '🐅', '🐇', '🐉', '🐎', '🐐', '🐓', '🐕', '🐖', '🐁', '🐂', '🐲', '🐡', '🐊', '🐫', '🐪', '🐆', '🐈', '🐩', '🐾', '💐', '🌸', '🌷', '🍀', '🌹', '🌻', '🌺', '🍁', '🍃', '🍂', '🌿', '🌾', '🍄', '🌵', '🌴', '🌲', '🌳', '🌰', '🌱', '🌼', '🌐', '🌞', '🌝', '🌚', '🌑', '🌒', '🌓', '🌔', '🌕', '🌖', '🌗', '🌘', '🌜', '🌛', '🌙', '🌍', '🌎', '🌏', '🌋', '🌌', '🌠', '⭐', '☀', '⛅', '☁', '⚡', '☔', '❄', '⛄', '🌀', '🌁', '🌈', '🌊', '🎍', '💝', '🎎', '🎒', '🎓', '🎏', '🎆', '🎇', '🎐', '🎑', '🎃', '👻', '🎅', '🎄', '🎁', '🎋', '🎉', '🎊', '🎈', '🎌', '🔮', '🎥', '📷', '📹', '📼', '💿', '📀', '💽', '💾', '💻', '📱', '☎', '📞', '📟', '📠', '📡', '📺', '📻', '🔊', '🔉', '🔈', '🔇', '🔔', '🔕', '📢', '📣', '⏳', '⌛', '⏰', '⌚', '🔓', '🔒', '🔏', '🔐', '🔑', '🔎', '💡', '🔦', '🔆', '🔅', '🔌', '🔋', '🔍', '🛁', '🛀', '🚿', '🚽', '🔧', '🔩', '🔨', '🚪', '🚬', '💣', '🔫', '🔪', '💊', '💉', '💰', '💴', '💵', '💷', '💶', '💳', '💸', '📲', '📧', '📥', '📤', '✉', '📩', '📨', '📯', '📫', '📪', '📬', '📭', '📮', '📦', '📝', '📄', '📃', '📑', '📊', '📈', '📉', '📜', '📋', '📅', '📆', '📇', '📁', '📂', '✂', '📌', '📎', '✒', '✏', '📏', '📐', '📕', '📗', '📘', '📙', '📓', '📔', '📒', '📚', '📖', '🔖', '📛', '🔬', '🔭', '📰', '🎨', '🎬', '🎤', '🎧', '🎼', '🎵', '🎶', '🎹', '🎻', '🎺', '🎷', '🎸', '👾', '🎮', '🃏', '🎴', '🀄', '🎲', '🎯', '🏈', '🏀', '⚽', '⚾', '🎾', '🎱', '🏉', '🎳', '⛳', '🚵', '🚴', '🏁', '🏇', '🏆', '🎿', '🏂', '🏊', '🏄', '🎣', '☕', '🍵', '🍶', '🍼', '🍺', '🍻', '🍸', '🍹', '🍷', '🍴', '🍕', '🍔', '🍟', '🍗', '🍖', '🍝', '🍛', '🍤', '🍱', '🍣', '🍥', '🍙', '🍘', '🍚', '🍜', '🍲', '🍢', '🍡', '🍳', '🍞', '🍩', '🍮', '🍦', '🍨', '🍧', '🎂', '🍰', '🍪', '🍫', '🍬', '🍭', '🍯', '🍎', '🍏', '🍊', '🍋', '🍒', '🍇', '🍉', '🍓', '🍑', '🍈', '🍌', '🍐', '🍍', '🍠', '🍆', '🍅', '🌽', '🏠', '🏡', '🏫', '🏢', '🏣', '🏥', '🏦', '🏪', '🏩', '🏨', '💒', '⛪', '🏬', '🏤', '🌇', '🌆', '🏯', '🏰', '⛺', '🏭', '🗼', '🗾', '🗻', '🌄', '🌅', '🌃', '🗽', '🌉', '🎠', '🎡', '⛲', '🎢', '🚢', '⛵', '🚤', '🚣', '⚓', '🚀', '✈', '💺', '🚁', '🚂', '🚊', '🚉', '🚞', '🚆', '🚄', '🚅', '🚈', '🚇', '🚝', '🚋', '🚃', '🚎', '🚌', '🚍', '🚙', '🚘', '🚗', '🚕', '🚖', '🚛', '🚚', '🚨', '🚓', '🚔', '🚒', '🚑', '🚐', '🚲', '🚡', '🚟', '🚠', '🚜', '💈', '🚏', '🎫', '🚦', '🚥', '⚠', '🚧', '🔰', '⛽', '🏮', '🎰', '♨', '🗿', '🎪', '🎭', '📍', '🚩', '⬆', '⬇', '⬅', '➡', '🔠', '🔡', '🔤', '↗', '↖', '↘', '↙', '↔', '↕', '🔄', '◀', '▶', '🔼', '🔽', '↩', '↪', 'ℹ', '⏪', '⏩', '⏫', '⏬', '⤵', '⤴', '🆗', '🔀', '🔁', '🔂', '🆕', '🆙', '🆒', '🆓', '🆖', '📶', '🎦', '🈁', '🈯', '🈳', '🈵', '🈴', '🈲', '🉐', '🈹', '🈺', '🈶', '🈚', '🚻', '🚹', '🚺', '🚼', '🚾', '🚰', '🚮', '🅿', '♿', '🚭', '🈷', '🈸', '🈂', 'Ⓜ', '🛂', '🛄', '🛅', '🛃', '🉑', '㊙', '㊗', '🆑', '🆘', '🆔', '🚫', '🔞', '📵', '🚯', '🚱', '🚳', '🚷', '🚸', '⛔', '✳', '❇', '❎', '✅', '✴', '💟', '🆚', '📳', '📴', '🅰', '🅱', '🆎', '🅾', '💠', '➿', '♻', '♈', '♉', '♊', '♋', '♌', '♍', '♎', '♏', '♐', '♑', '♒', '♓', '⛎', '🔯', '🏧', '💹', '💲', '💱', '©', '®', '™', '〽', '〰', '🔝', '🔚', '🔙', '🔛', '🔜', '❌', '⭕', '❗', '❓', '❕', '❔', '🔃', '🕛', '🕧', '🕐', '🕜', '🕑', '🕝', '🕒', '🕞', '🕓', '🕟', '🕔', '🕠', '🕕', '🕖', '🕗', '🕘', '🕙', '🕚', '🕡', '🕢', '🕣', '🕤', '🕥', '🕦', '✖', '➕', '➖', '➗', '♠', '♥', '♣', '♦', '💮', '💯', '✔', '☑', '🔘', '🔗', '➰', '🔱', '🔲', '🔳', '◼', '◻', '◾', '◽', '▪', '▫', '🔺', '⬜', '⬛', '⚫', '⚪', '🔴', '🔵', '🔻', '🔶', '🔷', '🔸', '🔹'
];
